emacs-ez.tex
% Created 2016-05-27 Fri 13:49
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{lmodern}
\usepackage[QX]{fontenc}
\author{Joshua Branson}
\date{\today}
\title{Emacs Cheatsheat}
\hypersetup{
 pdfauthor={Joshua Branson},
 pdftitle={Emacs Cheatsheat},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.4)},
 pdflang={English}}
\begin{document}

\maketitle

\section{Why use Emacs?}
\label{sec:orgheadline1}

For starters, Emacs is freedom respecting software.  This is often shortened to "free software", or "libre software".  This means that one has the right to:
\begin{itemize}
\item 0 run the program for any reason.
\item 1 the right to help yourself.
This is the right to study the source code and change it.
\item 2 The right to help your neighbor.
This is the right to distribute unmodified copies of Emacs to your neighbor.  You could also even sell this program to your neighbor!
\item 3 The right to help your community.
This is the right to distribute your modified version of Emacs.  You could also sell your modified version!

So Emacs grants you, the user, many freedoms that other programs lack.  Please notice that this is computing freedom.  Free software is liberty software, not necessarily gratis software.  However,  Emacs is Free software, and it can usually be obtained as gratis software.
\end{itemize}

There are also some practical reasons to use Emacs. Plenty of programmers these days use drastically simple programming editors like notepad, notepad++, nano.  These editors are "What you see is what you get" type editors, and they are frustratingly lacking in good features, and one cannot easily configure these editors to do anything that you would like.  Emacs gives you the ability to install hundreds, if not thousands of add-ons, and configure \textbf{everything} that your text editor does!

So what can Emacs do?  You can use emacs to use commands to manipulate and transpose regions of text, write in nearly every programming language imaginable, read your email, browse the internet, play games, browse local files, look at a photo gallery, stream internet music, watch online movies (coming soon), create text expandable abbreviations, clock your working hours, invoice clients, schedule your weekly agenda, syntax checking, browse documentation, commit your development changes to version control, emulate vim, all of which can be configured and tweaked emacs in numerous ways.  If that doesn't satisfy you, then you can programmatically change emacs' behavior to better suit your development workflow.

\section{Built in Emacs Features}
\label{sec:orgheadline17}
\subsection{Movement}
\label{sec:orgheadline2}
In emacs the blinking cursor is called "point".  As you type the blinking cursor moves, so we say that point moves as you type.  One can always use the arrow keys to move point, but Emacs provides some nifty ways of moving point as well.  Pressing and holding the control key whilst hitting "f" will move point forward one character.  In Emacs lingo we call that a keychord, and it is denoted like this "C-f".  Similarly, holding and pressing the control key, then hitting "b" will move point backward one character.  That keychord is denoted as "C-b".  "C-p" will move point back to the up previous line, and "C-n" will move point down to the next line.  So the basic movement keys look like this:

\begin{verbatim}
                   "C-p"
                     /\
                     ||
                     ||
                     ||
                     ||
                     ||
"C-b" <--------------||---------------> "C-f"
                     ||
                     ||
                     ||
                     ||
                     ||
                     ||
                     ||
                     \/
                   "C-n"
\end{verbatim}

\subsection{Bookmarks}
\label{sec:orgheadline3}
Emacs bookmarks are nifty ways of saving your place in a file.  If you wish to return to some obscure local or remote file, you can easily save point's current position, and return to it later.

\begin{itemize}
\item \texttt{C-x r m}  sets a bookmark for you at point and it prompts you to name it
\item \texttt{C-x r b}  jumps you to a bookmark
\end{itemize}
\subsection{Dired}
\label{sec:orgheadline6}
Dired is the emacs file manager.  It opens a buffer displaying all your files in the specified directory.  With it you can perform numerous commands on marked files, like deleting, copying, moving, or even creating your own command.
\subsubsection{Commands}
\label{sec:orgheadline4}
\begin{itemize}
\item \texttt{n} next line
\item \texttt{p} previous line
\item \texttt{m} mark the current file under point
\item \textasciitilde{}\% m REGEXP <RET>  mark files based on a regular expression
\item \texttt{Q} dired-do-query-replace-regexp lets you search and replace for text inside all marked files
\begin{itemize}
\item Press y, to replace the current match
\item press \texttt{n} to skip the current match
\item press \texttt{!} to replace all the matches in the current buffer
\item Press \texttt{Y} to replace all the remaining matches in all buffers
\end{itemize}
\item how to recursively search and replace
\item M-x wdired-change-to-wdired-mode
Makes the contents of the dired buffer editable.  Once you are done making changes type \texttt{C-c C-c}.  This saves your changes.  It is a nifty way to easily change multiple file permissions, file names, etc.
\end{itemize}
\subsubsection{Image Dired}
\label{sec:orgheadline5}
You can also view images inside dired!  Mark the images you wish to view, then press C-t d (image-dired-display-thumbs). Alternatively, you could also just run the command M-x image-dired.
\subsection{Macros}
\label{sec:orgheadline7}
A Macro is a remembered sequence of Emacs keychords that can be repeated.  This is useful to easily repeat similar text, or delete, edit similar text.  For example, I can write out the numbers 1 through a 100, if I hit 30 keys.  I could write the numbers 1 through 1,000 by typing 31 keys!

\begin{itemize}
\item \texttt{C-x (} begin recording a keyboard macro
\item \texttt{C-x )} end recording a keyboard macro
\item \texttt{C-x e}  performs the last created keyboard macro
\item \texttt{C-x q} prompt, when you use this macro if you want to continue.  You can enter C-r to briefly step out of the macro
and do some edits yourself, then C-M-c will allow you to continue execution of the macro.
\end{itemize}
