emacs-ez.tex
\subsection{Narrowing}
\label{sec:orgheadline8}
Narrowing commands make Emacs only display portions of the buffer, whilst hidding all other regions.  While Emacs is narrowed, all entered commands only affected the displayed regions.  This means any hidden area cannot be modified while Emacs is narrowed.  This is useful if you only want a macro to execute within a specific function.
  \texttt{C-x n <letter>}
    \texttt{d} narrow to defun
    \texttt{r} widen to region
    \texttt{s} narrow to a org subtree
    \texttt{w} widden to the whole buffer

A much better way to use the narrowing commands is just to make emacs guess what you want whenever you press "C-x n", and that's what the following snippet does.  I recommend that you put it in your .emacs:

I found this code snippet \href{http://endlessparentheses.com/emacs-narrow-or-widen-dwim.html}{here.}

\begin{verbatim}
;; Also set up narrow dwin
(defun narrow-or-widen-dwim (p)
  "Widen if buffer is narrowed, narrow-dwim otherwise.
Dwim means: region, org-src-block, org-subtree, or defun,
whichever applies first. Narrowing to org-src-block actually
calls `org-edit-src-code'.

With prefix P, don't widen, just narrow even if buffer is
already narrowed."
  (interactive "P")
  (declare (interactive-only))
  (cond ((and (buffer-narrowed-p) (not p)) (widen))
        ((region-active-p)
         (narrow-to-region (region-beginning) (region-end)))
        ((derived-mode-p 'org-mode)
         ;; `org-edit-src-code' is not a real narrowing
         ;; command. Remove this first conditional if you
         ;; don't want it.
         (cond ((ignore-errors (org-edit-src-code))
                (delete-other-windows))
               ((ignore-errors (org-narrow-to-block) t))
               (t (org-narrow-to-subtree))))
        ((derived-mode-p 'latex-mode)
         (LaTeX-narrow-to-environment))
        (t (narrow-to-defun))))

;; This line actually replaces Emacs' entire narrowing
;; keymap, that's how much I like this command. Only copy it
;; if that's what you want.
(define-key ctl-x-map "n" #'narrow-or-widen-dwim)
\end{verbatim}
\subsection{Rectangles}
\label{sec:orgheadline9}
You can easily create a rectangle with evil mode with C-v.  Once you have a rectangle you can do these commands:

\begin{itemize}
\item \texttt{C-x r o} insert blank spaces to the left of the rectangle region
\item \texttt{C-x r N} insert numbers all along the left of the rectangle region
\end{itemize}
\subsection{Registers}
\label{sec:orgheadline10}
Number Registers
-`C-u number C-x r n r`
Store number into register r (number-to-register).

`C-u number C-x r + r`
If r contains a number, increment the number in that register by number. Note that command C-x r + (increment-register) behaves differently if r contains text. See Text Registers.

`C-x r i r`
Insert the number from register r into the buffer.

`C-x r i` is the same command used to insert any other sort of register contents into the buffer. `C-x r +` with no numeric argument increments the register value by 1; `C-x r n` with no numeric argument stores zero in the register.

\texttt{C-x r s R}  save text to register R
\texttt{M-x append-to-register R} appends text to Register R
\subsection{Windows Commands}
\label{sec:orgheadline11}
In emacs the entire emacs program takes up a \textbf{frame}.  But emacs allows you to view two different files in the same frame, by splitting the frame in half, or in two \textbf{windows}.
\begin{itemize}
\item \texttt{C-x o} Delete the selected window
\item \texttt{C-x 1} Delete all the windows except the one that currently has point
\item \texttt{C-x \textasciicircum{}} make the selected window taller
\item \texttt{C-x \{} make the selected window narrower
\item \texttt{C-x \}} make the selected window wider
\end{itemize}
\subsection{org-mode}
\label{sec:orgheadline16}
Emacs org-mode really deserves its own cheatsheat, so I won't go into much detail here, but I'll start you off with the basics.  Org-mode is Emacs' organizational mode, and it's pure gold!  With Org-mode I organize my daily agenda, todo lists. Parts of my emacs init files is written in it.  I use it to keep track of my working hours, with which I then invoice clients.  I use its markup to write MIME emails.  I wrote all of my documentation in it, and I keep track of my finances with it!  It truly is a remarkable emacs mode!
\subsubsection{Org-mode's hierarchical structure}
\label{sec:orgheadline13}
Org-mode lets you easily insert headings and sub headings with "C-RET".  If you press it many times, you'll have something like this:

\begin{verbatim}
*
*
*
*
\end{verbatim}

A line with just one "*" is a top level heading.  If it has a two "**" below it, then it now has a sub-heading.  Just like the following:
\begin{verbatim}
* I am a top level heading
** I am a sub-heading.
\end{verbatim}

\paragraph{Todo lists}
\label{sec:orgheadline12}
One can easily create simple todo lists with org-mode.  In any org file press "C-RET".  A "*" will have inserted itself into your buffer.  Pressing "C-c C-t" will add the words "TODO",  pressing "C-c C-t" again, will change the status to DONE.  You will end up with something looking like:

\begin{verbatim}
* DONE
\end{verbatim}


\subsubsection{org-babel}
\label{sec:orgheadline15}
Org babel is a the best approach towards literate programming ever attempted, and it works!  Almost all programming languages treat code as the first order citizen and hides comments behind a simple syntax.  For example here is some javascript:

\begin{verbatim}
// initialize the variable
var i = 5;
if (i < 6) {
  i++;
}
console.log (i);
\end{verbatim}

The comment "initialize the variable" comes after the comment syntax "//".  In literate programming the code portion of the file is "commented" and the comments do not hide behind a comment syntax.  Let me give you an example of the literate kind:

\begin{verbatim}
Let's write a trivial js function the literate way
#+BEGIN_SRC js :exports code
  var i = 5;
  if (i < 6) {
    i++;
  }
  console.log (i);
#+END_SRC
\end{verbatim}

\begin{verbatim}
5 + 5
\end{verbatim}

How cool is that?
\paragraph{Specific header arguments}
\label{sec:orgheadline14}
\url{http://orgmode.org/manual/Specific-header-arguments.html}
\href{org#Specific\%20header\%20arguments}{\url{org#Specific} header arguments}

\begin{itemize}
\item :results
syntax:
:results [raw | silent | value | output ]
value is function mode.  It means that org-mode will use the last executed command as the value of the output.
ie:
\end{itemize}

\begin{verbatim}
import time
print("Hello, today's date is %s" % time.ctime())
print('Two plus two is')
return 2 + 2
\end{verbatim}

\begin{verbatim}
echo "hello world"
echo "big cat"
ls -lh | grep emacs.org
\end{verbatim}

\begin{itemize}
\item :exports [code | results | node | both]
\item :dir
Specify a default directory that the code is to be run in
:dir <dir>
\end{itemize}
\section{Helpful Emacs modes}
\label{sec:orgheadline37}
\subsection{Bug Hunter}
\label{sec:orgheadline18}
 This will help you find bugs in your init file. SOOO helpful.
\url{https://github.com/Malabarba/elisp-bug-hunter}
M-x bug-hunter-init-file
