emacs-ez.tex
\subsubsection{Commands}
\label{sec:orgheadline34}
\begin{itemize}
\item \texttt{a} copies buffer a diff to buffer b
\item \texttt{b} copies buffer b diff to buffer a
\item \texttt{A} toggles readonly mode of buffer a
\item \texttt{B} toggles readonly mode of buffer b
\item \texttt{wa} save buffer a
\item \texttt{wb} save buffer b
\item \texttt{!} update the differance regions.  If you press \texttt{a} and \texttt{b} multiple times, you should probably do a \texttt{!}
\item \texttt{*} highlights the words in the diff region that differ
\item \texttt{ra} restore the diff region in buffer a
\item \texttt{rb} restore the diff region in buffer b
\item \texttt{z} suspend the ediff session
\item \texttt{s} make the merge buffer as small as possible
\end{itemize}

When you specify files, you can edit the files as root using tramp's syntax like this.

/su::/path/to/file
\subsection{Tramp}
\label{sec:orgheadline36}
Tramp is an emacs extension that lets you edit remote files. To use tramp, just begin by opening a file via \texttt{C-x C-f} (find-file) then typing one of the following special syntaxes:

/HOST:FILENAME
/USER@HOST:FILENAME
/USER@HOST\#PORT:FILENAME
/METHOD:USER@HOST:FILENAME
/METHOD:USER@HOST\#PORT:FILENAME
\section{Regexp}
\label{sec:orgheadline38}
Regular expressions are nifty ways of searching/replacing regions of text.

Consider this example

\begin{verbatim}
if (isadmin() || ismanager ()) {
    //some code here
}
\end{verbatim}

Suppose that you want to add a space between both "is" in the functions.  The following would do this:

\texttt{M-x dired-do-query-replace-regexp is\textbackslash{}(admin\textbackslash{}|manager\textbackslash{}) RET is \textbackslash{}1 RET}

But let's get a basic understanding of regexps.

\section{Useful Elisp Libraries}
\label{sec:orgheadline39}
\begin{itemize}
\item ctable \url{https://github.com/kiwanami/emacs-ctable}
\item s \url{https://github.com/magnars/s.el}
\item f \url{https://github.com/rejeep/f.el}
\item dash \url{https://github.com/magnars/dash.el}
\end{itemize}
\end{document}
